API/Codeigniter/codeigniter_4_v2/api_project/app/Controllers/LoginApi.php

SELECT *
FROM `user_api`
WHERE `User_email` = 'user@correo.com'
 LIMIT 1
---
    public function index(){
      $userApiModel=new UserApiModel();
      $email=$this->request->getVar('email');
      $password=$this->request->getVar('password');
      $userApi=$userApiModel->where('User_email',$email)->first();