API/Codeigniter/codeigniter_4_v2/api_project/app/Controllers/RegisterUserApi.php

  public function index()
  {
      $rules=[

        'email'=>['rules'=>'required|min_length[4]|max_length[255]|valid_email|is_unique[user_api.User_email]'],
        'password'=>['rules'=>'required|min_length[4]|max_length[255]'],
        'confirm_password'=>['label'=>'confirm_password','rules'=>'matches[password]']
      ];

      if($this->validate($rules)){
        $model=new UserApiModel();
        $data=[
          'User_email'=>$this->request->getVar('email'),
          'User_password'=>password_hash($this->request->getVar('password'),PASSWORD_DEFAULT)
        ];
        $model->save($data);
---
INSERT INTO `user_api` (`User_email`, `User_password`, `created_at`, `updated_at`) VALUES ('user@correo.com', '$2y$10$tYAJU5kbFoNVZhRFC1.RteA3JbXm6zYRcnPivnjGvonQr2QxVm14u', '2025-03-09 19:06:12', '2025-03-09 19:06:12')