CRUD_V2/crud/app/Controllers/Dashboard.php

  public function index()
  {
    $this->data['title'] = "DASHBOARD";
    $this->data['profile'] =  $this->profileModel->where('User_id_fk', (int)$this->getSessionIdUser()['User_id'])->first();
---
SELECT *
FROM `profiles`
WHERE `User_id_fk` = 4
 LIMIT 1