CRUD_V2/crud/app/Controllers/Login.php

  public function logIn()
  {
    if ($this->request->isAJAX()) {
      $email = $this->request->getVar('User_user');
      $password = $this->request->getVar('User_password');
      $user = $this->loginModel->where('User_user', $email)->first();
---
SELECT *
FROM `users`
WHERE `User_user` = 'd.casallas@sinapsist.com.co'
 LIMIT 1